**Goals**:
* connect to the database
* query the tables in the database

In [1]:
# import the libraries needed

import pandas as pd
import sqlite3

### Conect to the database

In [2]:
# connect to database

conn = sqlite3.connect('../data/prod_sample.db')

In [3]:
conn

In [4]:
# identify tables in database

cursor = conn.cursor()
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cursor.fetchall())

[('stock_description',), ('online_retail_history',)]

### Query the Tables

Table 1: Online Retail History

In [5]:
# write sql query to select online retail history data

query = """select *
          from online_retail_history
"""

In [6]:
# use the read_sql function in pandas to read a query into a DataFrame

pd.read_sql(query, conn)

,Invoice,StockCode,Quantity,InvoiceDate,Price,CustomerID,Country
0,536365,85123A,6,2010-12-01 08:26:00,2.55,u1785,United Kingdom
1,536365,71053,6,2010-12-01 08:26:00,3.39,u1785,United Kingdom
2,536365,84406B,8,2010-12-01 08:26:00,2.75,u1785,United Kingdom
3,536365,84029G,6,2010-12-01 08:26:00,3.39,u1785,United Kingdom
4,536365,84029E,6,2010-12-01 08:26:00,3.39,u1785,United Kingdom
...,...,...,...,...,...,...,...
541905,581587,22899,6,2011-12-09 12:50:00,2.10,u1268,France
541906,581587,23254,4,2011-12-09 12:50:00,4.15,u1268,France
541907,581587,23255,4,2011-12-09 12:50:00,4.15,u1268,France
541908,581587,22138,3,2011-12-09 12:50:00,4.95,u1268,France
541909,581587,POST,1,2011-12-09 12:50:00,18.00,u1268,France

In [7]:
# write sql query to count number of rows in online retail history data

query = """select count(*)
          from online_retail_history
"""

pd.read_sql(query, conn)

   count(*)
0    541910

Table 2: Stock Description

In [8]:
query = """select *
          from stock_description
"""

pd.read_sql(query, conn)

      StockCode                  Description
0         10002  INFLATABLE POLITICAL GLOBE
1         10080     GROOVY CACTUS INFLATABLE
2         10120                 DOGGY RUBBER
3        10123C        HEARTS WRAPPING TAPE
4        10124A  SPOTS ON RED BOOKCOVER TAPE
...         ...                          ...
3947  DCGSSGIRL              GIRLS PARTY BAG
3948        DOT               DOTCOM POSTAGE
3949       PADS   PADS TO MATCH ALL CUSHIONS
3950       POST                      POSTAGE
3951          S                      SAMPLES

[3952 rows x 2 columns]

In [9]:
query = """select count(*)
          from stock_description
"""

pd.read_sql(query, conn)

   count(*)
0      3952

In [11]:
query = """select *
          from online_retail_history
"""

online_retail_history = pd.read_sql(query, conn)

In [12]:
online_retail_history.head()

,Invoice,StockCode,Quantity,InvoiceDate,Price,CustomerID,Country
0,536365,85123A,6,2010-12-01 08:26:00,2.55,u1785,United Kingdom
1,536365,71053,6,2010-12-01 08:26:00,3.39,u1785,United Kingdom
2,536365,84406B,8,2010-12-01 08:26:00,2.75,u1785,United Kingdom
3,536365,84029G,6,2010-12-01 08:26:00,3.39,u1785,United Kingdom
4,536365,84029E,6,2010-12-01 08:26:00,3.39,u1785,United Kingdom

In [13]:
online_retail_history.shape

(541910, 7)

In [14]:
online_retail_history.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541910 entries, 0 to 541909
Data columns (total 7 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      541910 non-null  object
 1   StockCode    541910 non-null  object
 2   Quantity     541910 non-null  int64
 3   InvoiceDate  541910 non-null  object
 4   Price        541910 non-null  float64
 5   CustomerID   406830 non-null  object
 6   Country      541910 non-null  object
dtypes: float64(1), int64(1), object(5)
memory usage: 28.9+ MB

In [15]:
online_retail_history.describe()

            Quantity          Price
count  541910.000000  541910.000000
mean        9.552234       4.611138
std       218.080957      96.759765
min    -80995.000000  -11062.060000
25%         1.000000       1.250000
50%         3.000000       2.080000
75%        10.000000       4.130000
max     80995.000000   38970.000000

In [16]:
type(online_retail_history)

pandas.core.frame.DataFrame